app/Controllers/CheckInController.php

SELECT `h`.`id`, `h`.`numero_habitacion`, `th`.`nombre` as `tipo_nombre`
FROM `habitacion` `h`
LEFT JOIN `tipo_habitacion` `th` ON `th`.`id` = `h`.`tipo_habitacion_id`
WHERE `h`.`estado` = 'disponible'
ORDER BY `h`.`numero_habitacion` ASC
SELECT *
FROM `lugar_origen`
---
    public function index()
    {
    // Cargar habitaciones disponibles con tipo
        $habitaciones = $this->db->table('habitacion h')
        ->select('h.id, h.numero_habitacion, th.nombre as tipo_nombre')
        ->join('tipo_habitacion th', 'th.id = h.tipo_habitacion_id', 'left')
        ->where('h.estado', 'disponible')
        ->orderBy('h.numero_habitacion', 'ASC')
        ->get()->getResult();

        $data = [
            'titulo' => 'Registro de Check-in',
            'usuario' => session()->get('usuario'),
            'lugares_origen' => $this->lugarOrigenModel->findAll(),