app/Controllers/ServicioController.php

SELECT *
FROM `servicio`
ORDER BY `nombre` ASC
---
    public function index()
    {
        $data = [
            'titulo'    => 'Hotéis Viña del Sur - Gestión de Servicios',
            'servicios' => $this->servicioModel->orderBy('nombre', 'ASC')->findAll(),