app/Controllers/ServicioExtraController.php

SELECT *
FROM `servicio`
WHERE `activo` = 1
---
    public function index()
    {
        // Obtener estancias activas (checkin/ocupada)
        $estancias = $this->estanciaModel->obtenerEstanciasActivasConDetalles();

        // Obtener servicios activos
        $servicios = $this->servicioModel->where('activo', 1)->findAll();