app/Models/EstanciaModel.php

    public function obtenerEstanciasActivasConDetalles($fecha = null)
    {
        $fecha = $fecha ?: date('Y-m-d');

        return $this->db->table('estancia e')
        ->select('
            e.*,
            h.nombres as huesped_nombres,
            h.apellidos as huesped_apellidos,
            h.doc_identidad,
            h.direccion,
            r.fecha_inicio,
            r.fecha_fin,
            hab.numero_habitacion,
            th.nombre as tipo_habitacion,
            lo.pais,
            lo.ciudad
            ')
        ->join('huesped h', 'h.id = e.huesped_id')
        ->join('reserva r', 'r.id = e.reserva_id')
        ->join('habitacion hab', 'hab.id = r.habitacion_id')
        ->join('tipo_habitacion th', 'th.id = hab.tipo_habitacion_id')
        ->join('lugar_origen lo', 'lo.id = h.lugar_origen_id', 'left')
        ->whereIn('e.estado', ['checkin', 'ocupada'])
        ->where("DATE(e.fecha_checkin) <= '$fecha'")
        ->where("(e.fecha_checkout IS NULL OR DATE(e.fecha_checkout) > '$fecha')")
        ->orderBy('e.fecha_checkin', 'DESC')
        ->get()->getResult();
---
SELECT `e`.*, `h`.`nombres` as `huesped_nombres`, `h`.`apellidos` as `huesped_apellidos`, `h`.`doc_identidad`, `h`.`direccion`, `r`.`fecha_inicio`, `r`.`fecha_fin`, `hab`.`numero_habitacion`, `th`.`nombre` as `tipo_habitacion`, `lo`.`pais`, `lo`.`ciudad`
FROM `estancia` `e`
JOIN `huesped` `h` ON `h`.`id` = `e`.`huesped_id`
JOIN `reserva` `r` ON `r`.`id` = `e`.`reserva_id`
JOIN `habitacion` `hab` ON `hab`.`id` = `r`.`habitacion_id`
JOIN `tipo_habitacion` `th` ON `th`.`id` = `hab`.`tipo_habitacion_id`
LEFT JOIN `lugar_origen` `lo` ON `lo`.`id` = `h`.`lugar_origen_id`
WHERE `e`.`estado` IN ('checkin','ocupada')
AND DATE(e.fecha_checkin) <= '2025-10-02'
AND (`e`.`fecha_checkout` IS NULL OR DATE(e.fecha_checkout) > '2025-10-02')
ORDER BY `e`.`fecha_checkin` DESC