app/Models/UsuarioModel.php

SELECT *
FROM `usuario`
WHERE `nombre` = 'admin'
AND `estado` = 'activo'
 LIMIT 1
---
    public function login($nombre, $contrasena)
    {
        // Busca usuario por nombre y que esté activo
        $usuario = $this->where('nombre', $nombre)
                        ->where('estado', 'activo')
                        ->first();

UPDATE `usuario` SET `ultima_conexion` = '2025-10-02 18:44:07'
WHERE `usuario`.`id` IN ('5')
---
    public function actualizarUltimaConexion($id)
    {
        $this->update($id, ['ultima_conexion' => date('Y-m-d H:i:s')]);